## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ReceiveFFISEmail"
      ~ last_modified                  = "2023-08-26T04:00:49.369+0000" -> "2023-08-26T04:01:04.129+0000"
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_dashboard.service_dashboard[0] will be updated in-place
  ~ resource "datadog_dashboard" "service_dashboard" {
        id                      = "4jj-dh7-k8z"
        tags                    = []
        # (9 unchanged attributes hidden)

      ~ template_variable {
-           default          = "production" -> null
          ~ defaults         = [
+               "production",
            ]
            name             = "env"
            # (2 unchanged attributes hidden)
        }
      ~ template_variable {
-           default          = "grants-ingest" -> null
          ~ defaults         = [
+               "grants-ingest",
            ]
            name             = "service"
            # (2 unchanged attributes hidden)
        }
      ~ template_variable {
-           default          = "*" -> null
          ~ defaults         = [
+               "*",
            ]
            name             = "version"
            # (2 unchanged attributes hidden)
        }

      ~ widget {
            id = 586102520798136

          ~ widget_layout {
              ~ height          = 7 -> 6
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 765147182310031

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 7 -> 6
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 5269155994094199

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 4355446696007666

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_success"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version, functionname:grants_ingest-downloadgrantsgovdb}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,handlername:downloadgrantsgovdb}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_failure"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,functionname:grants_ingest-downloadgrantsgovdb}.as_count()" -> "sum:aws.lambda.errors{$env,$service,$version,handlername:downloadgrantsgovdb}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

-                           style {
-                               line_type  = "solid" -> null
-                               line_width = "normal" -> null
-                               palette    = "dog_classic" -> null
                            }

                            # (2 unchanged blocks hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }

                # (2 unchanged blocks hidden)
            }

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 11 -> 9
                # (3 unchanged attributes hidden)
            }
        }
      ~ widget {
            id = 1674122871580718

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 15 -> 12
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 422054659633441

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 19 -> 15
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 4698201185606072

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 8984926842180895

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "cutoff_min(invocation_total - invocation_failure - records_saved, 0)" -> "invocation_total - invocation_failure - records_saved"
                                # (1 unchanged attribute hidden)

                                # (1 unchanged block hidden)
                            }

                          ~ query {
                              ~ metric_query {
                                  ~ name        = "invocation_total" -> "records_saved"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:persistffisdata}.as_count()" -> "sum:grants_ingest.PersistFFISData.opportunity.saved{$env,$service,$version}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                  ~ name        = "invocation_failure" -> "invocation_total"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:persistffisdata}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,handlername:persistffisdata}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
+                           query {
+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invocation_failure"
+                                   query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:persistffisdata}.as_count()"
                                }
                            }

-                           style {
-                               line_type  = "solid" -> null
-                               line_width = "normal" -> null
-                               palette    = "dog_classic" -> null
                            }

                            # (2 unchanged blocks hidden)
                        }

                        # (1 unchanged block hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (2 unchanged blocks hidden)
            }

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 23 -> 18
                # (3 unchanged attributes hidden)
            }
        }
      ~ widget {
            id = 470932311660352

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 27 -> 21
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 4986892022422065

          ~ widget_layout {
              ~ height          = 7 -> 6
              ~ y               = 31 -> 24
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 4370829310861988

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 678774157001084

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "exclude_null(failed)" -> "failed"
                                # (1 unchanged attribute hidden)

                                # (1 unchanged block hidden)
                            }
                          ~ formula {
                              ~ formula_expression = "exclude_null(published)" -> "published"
                                # (1 unchanged attribute hidden)

                                # (1 unchanged block hidden)
                            }
                          ~ formula {
                              ~ formula_expression = "cutoff_min(exclude_null(exclude_null(total_in_invocation) - exclude_null(published) - exclude_null(failed)), 0)" -> "total_in_invocation - published - failed"
                                # (1 unchanged attribute hidden)

                                # (1 unchanged block hidden)
                            }

-                           style {
-                               line_type  = "solid" -> null
-                               line_width = "normal" -> null
-                               palette    = "dog_classic" -> null
                            }

                            # (3 unchanged blocks hidden)
                        }

                        # (1 unchanged block hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (7 unchanged blocks hidden)
            }

          ~ widget_layout {
              ~ height          = 14 -> 13
              ~ y               = 38 -> 30
                # (3 unchanged attributes hidden)
            }
        }
      ~ widget {
            id = 6770716097912514

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 52 -> 43
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 1014225001610539

          ~ widget_layout {
              ~ height          = 7 -> 6
              ~ y               = 56 -> 46
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 6150420641126212

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 63 -> 52
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadFFISSpreadsheet.source_size"] will be created
+   resource "datadog_metric_metadata" "custom" {
+       description = "Size (in bytes) of the downloaded ffis.org spreadsheet file."
+       id          = (known after apply)
+       metric      = "grants_ingest.DownloadFFISSpreadsheet.source_size"
+       per_unit    = "file"
+       short_name  = "Source file size in bytes"
+       unit        = "byte"
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.ExtractGrantsGovDBToXML.xml.extracted"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.ExtractGrantsGovDBToXML.xml.extracted"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.ExtractGrantsGovDBToXML.xml.uploaded"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.ExtractGrantsGovDBToXML.xml.uploaded"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PersistFFISData.opportunity.saved"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PersistFFISData.opportunity.saved"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PersistGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PersistGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PersistGrantsGovXMLDB.opportunity.saved"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PersistGrantsGovXMLDB.opportunity.saved"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.event.published"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.event.published"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.grant_data.invalid"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.grant_data.invalid"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.invocation_batch_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.invocation_batch_size"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.item_image.build"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.item_image.build"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.item_image.malformatted_field"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.item_image.malformatted_field"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.record.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.record.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitFFISSpreadsheet.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitFFISSpreadsheet.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitFFISSpreadsheet.spreadsheet.row_count"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitFFISSpreadsheet.spreadsheet.row_count"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6f8aaafd2d2668bf4921fc0a60d83fba-3" -> (known after apply)
      ~ id                     = "355779dc7bdb718a67783759d3db9f04.zip" -> (known after apply)
      ~ key                    = "355779dc7bdb718a67783759d3db9f04.zip" -> "dd983df96eedb48a96f2b2ab26d5718b.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "xWeLprZ9nK6I_VsTwkAvLjaBc4zDoH8B" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-08-26T04:00:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:2/invocations" -> (known after apply)
      ~ s3_key                         = "355779dc7bdb718a67783759d3db9f04.zip" -> "dd983df96eedb48a96f2b2ab26d5718b.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f5066bba1269bcbc2f90afab6da0535eb9c27195,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:d715b494d1b2b9e3a99f1a1511596e7c606167b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "f5066bba1269bcbc2f90afab6da0535eb9c27195" -> "d715b494d1b2b9e3a99f1a1511596e7c606167b1"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "56dc9729e34d7972e589d2aa3af178c0-3" -> (known after apply)
      ~ id                     = "a3e6b443ee6b6ac8f0bcb62803324637.zip" -> (known after apply)
      ~ key                    = "a3e6b443ee6b6ac8f0bcb62803324637.zip" -> "382efb147f052b9f1520ffe947d7fef3.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "WjqYca7uNKw1nNUgczjohzBKLwpEVbIF" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-08-26T04:00:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:2/invocations" -> (known after apply)
      ~ s3_key                         = "a3e6b443ee6b6ac8f0bcb62803324637.zip" -> "382efb147f052b9f1520ffe947d7fef3.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:f5066bba1269bcbc2f90afab6da0535eb9c27195,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:d715b494d1b2b9e3a99f1a1511596e7c606167b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "f5066bba1269bcbc2f90afab6da0535eb9c27195" -> "d715b494d1b2b9e3a99f1a1511596e7c606167b1"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6076b8af96da89eb1a840156f9fb3194-3" -> (known after apply)
      ~ id                     = "71027f4f5526aeec7469be1fd654204a.zip" -> (known after apply)
      ~ key                    = "71027f4f5526aeec7469be1fd654204a.zip" -> "24d98be3f934700e35661a39052c6788.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "u_ldPCSprLuPc.7ShuV5Wf8g_8wwfmbB" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-EnqueueFFISDownload"
      ~ last_modified                  = "2023-08-26T04:00:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:2/invocations" -> (known after apply)
      ~ s3_key                         = "71027f4f5526aeec7469be1fd654204a.zip" -> "24d98be3f934700e35661a39052c6788.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f5066bba1269bcbc2f90afab6da0535eb9c27195,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:d715b494d1b2b9e3a99f1a1511596e7c606167b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "f5066bba1269bcbc2f90afab6da0535eb9c27195" -> "d715b494d1b2b9e3a99f1a1511596e7c606167b1"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d61dd643cc6852e7497e4272c3a256a4-3" -> (known after apply)
      ~ id                     = "13923015ac7e70bed8bcf029a03930ad.zip" -> (known after apply)
      ~ key                    = "13923015ac7e70bed8bcf029a03930ad.zip" -> "c12b42c242f32597571e7ff30fb9112c.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "zodCr6d55QR8_lmaNRsWfJfNWwitHqj0" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-08-26T04:00:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:2/invocations" -> (known after apply)
      ~ s3_key                         = "13923015ac7e70bed8bcf029a03930ad.zip" -> "c12b42c242f32597571e7ff30fb9112c.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f5066bba1269bcbc2f90afab6da0535eb9c27195,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:d715b494d1b2b9e3a99f1a1511596e7c606167b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "f5066bba1269bcbc2f90afab6da0535eb9c27195" -> "d715b494d1b2b9e3a99f1a1511596e7c606167b1"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e69abf1e02d043fc47cd18549b6030e3-3" -> (known after apply)
      ~ id                     = "a0d00dabd8ad619202e0d57ea2407fab.zip" -> (known after apply)
      ~ key                    = "a0d00dabd8ad619202e0d57ea2407fab.zip" -> "9a91243d2b41a01f03c80d72f2a93b84.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "1712KY4SqOisjxHtGmFW74sL8S33WH3j" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistFFISData"
      ~ last_modified                  = "2023-08-26T04:00:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:2/invocations" -> (known after apply)
      ~ s3_key                         = "a0d00dabd8ad619202e0d57ea2407fab.zip" -> "9a91243d2b41a01f03c80d72f2a93b84.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:f5066bba1269bcbc2f90afab6da0535eb9c27195,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:d715b494d1b2b9e3a99f1a1511596e7c606167b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "f5066bba1269bcbc2f90afab6da0535eb9c27195" -> "d715b494d1b2b9e3a99f1a1511596e7c606167b1"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6cd89243779e14484c462590497ec3e2-3" -> (known after apply)
      ~ id                     = "9b91277c4d1a1fce2180239661f295d4.zip" -> (known after apply)
      ~ key                    = "9b91277c4d1a1fce2180239661f295d4.zip" -> "6f286a95d697a2af14bcf2eef41e13e0.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "OukFsXhPFbF06LKThOO0QDqy3oohMMG4" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-08-26T04:00:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistGrantsGovXMLDB:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistGrantsGovXMLDB:2/invocations" -> (known after apply)
      ~ s3_key                         = "9b91277c4d1a1fce2180239661f295d4.zip" -> "6f286a95d697a2af14bcf2eef41e13e0.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:f5066bba1269bcbc2f90afab6da0535eb9c27195,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:d715b494d1b2b9e3a99f1a1511596e7c606167b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "f5066bba1269bcbc2f90afab6da0535eb9c27195" -> "d715b494d1b2b9e3a99f1a1511596e7c606167b1"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "18a532cef26657b5a51270c59e5a2c04-3" -> (known after apply)
      ~ id                     = "188649cbb93c93d63e6d9794ab34f516.zip" -> (known after apply)
      ~ key                    = "188649cbb93c93d63e6d9794ab34f516.zip" -> "f45e950e4e607d8f92a40e991e9184eb.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "pE48c_IFREyhHVoMf5pM1a9TElpEEL_D" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PublishGrantEvents"
      ~ last_modified                  = "2023-08-26T04:00:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PublishGrantEvents:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PublishGrantEvents:2/invocations" -> (known after apply)
      ~ s3_key                         = "188649cbb93c93d63e6d9794ab34f516.zip" -> "f45e950e4e607d8f92a40e991e9184eb.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f5066bba1269bcbc2f90afab6da0535eb9c27195,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents" -> "git.commit.sha:d715b494d1b2b9e3a99f1a1511596e7c606167b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents"
              ~ "DD_VERSION"                   = "f5066bba1269bcbc2f90afab6da0535eb9c27195" -> "d715b494d1b2b9e3a99f1a1511596e7c606167b1"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "dynamodb" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "3d9968dc5e2396324a6712fd135116de-3" -> (known after apply)
      ~ id                     = "b283ad169263d7d500738b6eb9e43c3f.zip" -> (known after apply)
      ~ key                    = "b283ad169263d7d500738b6eb9e43c3f.zip" -> "b681abff8ac68c635c5fe1fd3bb42168.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "cWd9vU8QOO5DPOGNp6tcmePhfRJdmFYE" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ReceiveFFISEmail"
      ~ last_modified                  = "2023-08-26T04:01:04.129+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ReceiveFFISEmail:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ReceiveFFISEmail:1/invocations" -> (known after apply)
      ~ s3_key                         = "b283ad169263d7d500738b6eb9e43c3f.zip" -> "b681abff8ac68c635c5fe1fd3bb42168.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:f5066bba1269bcbc2f90afab6da0535eb9c27195,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail" -> "git.commit.sha:d715b494d1b2b9e3a99f1a1511596e7c606167b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail"
              ~ "DD_VERSION"                     = "f5066bba1269bcbc2f90afab6da0535eb9c27195" -> "d715b494d1b2b9e3a99f1a1511596e7c606167b1"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6ab01e05a44d31efc240f6383fff420a-3" -> (known after apply)
      ~ id                     = "65aaf68f205fe78c591277748b4ac2c4.zip" -> (known after apply)
      ~ key                    = "65aaf68f205fe78c591277748b4ac2c4.zip" -> "3ba3ccfff460db271873ceed5e49e2c3.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "ube4oerL0VtU_kCd9UcHp8LJPX3sdoZK" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-08-26T04:00:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitFFISSpreadsheet:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitFFISSpreadsheet:2/invocations" -> (known after apply)
      ~ s3_key                         = "65aaf68f205fe78c591277748b4ac2c4.zip" -> "3ba3ccfff460db271873ceed5e49e2c3.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:f5066bba1269bcbc2f90afab6da0535eb9c27195,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:d715b494d1b2b9e3a99f1a1511596e7c606167b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "f5066bba1269bcbc2f90afab6da0535eb9c27195" -> "d715b494d1b2b9e3a99f1a1511596e7c606167b1"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b65946a478c5e2e25281ac4c45ae9345-3" -> (known after apply)
      ~ id                     = "b68feb0a10102c4b64ed9a51699e1297.zip" -> (known after apply)
      ~ key                    = "b68feb0a10102c4b64ed9a51699e1297.zip" -> "c53434236f5dfaddc379bc241fb7d6df.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "P_MBbRXGP_27m10PmemEvjEnPhz8bfmM" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-08-26T04:00:06.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitGrantsGovXMLDB:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitGrantsGovXMLDB:2/invocations" -> (known after apply)
      ~ s3_key                         = "b68feb0a10102c4b64ed9a51699e1297.zip" -> "c53434236f5dfaddc379bc241fb7d6df.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:f5066bba1269bcbc2f90afab6da0535eb9c27195,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:d715b494d1b2b9e3a99f1a1511596e7c606167b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "f5066bba1269bcbc2f90afab6da0535eb9c27195" -> "d715b494d1b2b9e3a99f1a1511596e7c606167b1"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 21 to add, 29 to change, 20 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/6007016455)*